package chap02.section2

fun main()
{
    var x = 4
    // var x = 0
    // var x = 1


    var y = 0b0000_1010
    var z = 0x0F

    println("x shl 2 -> ${x shl 2}") // 16
    println("x.inv() -> ${x.inv()}") // 0000 0000 0000 0100 -> 1111 1111 1111 1011 이렇게 변환됨 -> 0000 0000 0000 0101 5와 더하면 모두 0이(2의 보수) 되므로 -5
                                     // 0000 0000 0000 0000 -> 1111 1111 1111 1111 이렇게 변환됨 -> 0000 0000 0000 0001 1와 더하면 모두 0이(2의 보수) 되므로 -1
                                     // 0000 0000 0000 0001 -> 1111 1111 1111 1110 이렇게 변환됨 -> 0000 0000 0000 0010 2와 더하면 모두 0이(2의 보수) 되므로 -2

    println("y shr 2 -> ${y/4}, ${y shr 2}")  // 2   // 2
    println("x shl 4 -> ${x*16}, ${x shl 4}") // 64  // 64
    println("z shl 4 -> ${z*16}, ${z shl 4}") // 240 // 240

    x = 64
    println("x shr 4 -> ${x/4}, ${x shr 2}")  // 16  // 16

}